
/* Class = "NSButtonCell"; title = "Yes, I accept these risks"; ObjectID = "EzI-6V-u2P"; */
"EzI-6V-u2P.title" = "Oui, j'accepte ces risques";

/* Class = "NSTextFieldCell"; title = "Apple makes significant changes to macOS in every upgrade. To continue providing reliable and safe backups, we must modify and test CCC against new OS releases to accommodate changes in the operating system and the filesystem. This is not a trivial procedure, we spend weeks performing hundreds of tests against the new OS.\n\nIf you continue to use this version of CCC on this OS, your backups could be incomplete, non-functional, unreliable, or, at worst, an OS change could cause CCC to work in an unpredictable manner. \n\nCCC has the privilege and capacity to DELETE data. While we do not anticipate that future OS changes would lead CCC to cause harm to your system or data, it is impossible for us to predict that. If you continue to use this untested version of CCC on this new OS, are you willing to accept these potential risks to your data?"; ObjectID = "PTM-A4-tAM"; */
"PTM-A4-tAM.title" = "Lors de chaque mise à jour, Apple apporte des modifications significatives à macOS. Pour pouvoir continuer à vous proposer des outils de sauvegarde fiables et sécurisés, nous devons modifier et tester CCC sur les nouvelles versions du système d'exploitation afin de l'adapter aux modifications apportées au système d'exploitation et au système de fichiers. Cette procédure est si complexe que nous passons plusieurs semaines à réaliser des centaines de tests sur le nouveau système d'exploitation.\n\nSi vous continuez à utiliser cette version de CCC sur ce système d'exploitation, vous risquez de vous retrouver avec des sauvegardes incomplètes, inutilisables ou peu fiables. Pire, une modification du système d'exploitation pourrait provoquer des dysfonctionnements de CCC.\n\nCCC dispose de privilèges et d'autorisations lui permettant de SUPPRIMER des données. En principe, les modifications apportées au système d'exploitation ne sont pas censées permettre à CCC d'endommager votre système ou vos données, mais nous ne pouvons pas vous le garantir à 100 %. Si vous continuez à utiliser cette version non testée de CCC sur ce nouveau système d'exploitation, acceptez-vous les risques potentiels d'endommagement de vos données ?";

/* Class = "NSButtonCell"; title = "No, show me the update options"; ObjectID = "zs0-Dc-0nt"; */
"zs0-Dc-0nt.title" = "Non, afficher les options de mise à jour";
